{"1": "Because having a degree doesn't mean that engineers are employable!!!\n\nThere are jobs… but engineers are not selected for one of the following reasons\n\n * Competency Mismatch\n * Competency Deficiency\n * Low Confidence\n * Poor learnability\nI can write a long rant on the system, but i will focus on the solution…\n\nWhat can a engineering Student do so that he or she is employable when he or she passes out?\n\nI. Be clear about your Career Goals\n\n * If you have graduated or are about to graduate with an engineering degree it means that you are an adult. Even if all your life papa and mummy has made decisions for you, the career decisions have to be made by you\n * Research on what opportunities lie in your chosen career path. You have spent 4 years studying engineering. So best way to leverage that is to work in same or allied fields.\n * Remember it is not the money which converts into competency…… It is the competency which converts into money. So make a choice carefully based on what your skills and strengths are\nII. Be aware of your technical competencies\n\n * Be clear what your technical competencies are. If you are not sure of your skills and abilities how do you expect employers to pay you ?\n * If you are still studying assess your technical strengths and see to it that you focus on them. Read about the topic over and above the syllabus\n * Take time out and work on keeping your technical knowledge current by keeping in touch with current trends and innovations in your field\nIII. Work on your Language skills\n\n * In india English is the language of choice for top companies. Please hone your spoken english skills with all focus\n * Learn to articulate ideas in simple language which you are comfortable with\n * Read a lot… Online material is very accessible nowadays\n * Learn basics of writing formal emails\n * Write your won resume with the hep of a professional (fiend or family member)\n * And please prepare the answer to the question “Please tell me something about yourself”\nIV. Learn basic non verbal communication (Body Language) skills\n\n * Understand that body language plays a large role in how you are perceived by your employer\n * Basic Skills are\n * \n * Maintaining eye contact when you speak\n * Not fiddling with your hands or folding them when talking to someone\n * A firm handshake is a necessary skill\n * No playing with hair or foot tapping when nervous\n * (Google for more info)\n\nV. Learn to be a Team player\n\nTeam skills are essential.\n\n * Learn to make friends and engage in conversations\n * Learn to trust people to the extent of sharing knowledge and know how\n * Learn to mentor juniors… The skill is invaluable in corporate life\nVI. Don't be a Snob\n\n * Don't waste years waiting for what you consider the “Ideal Job”\n * Remember… Competency is your choice… You build it…\n * Don't focus on peers and set your own path\n * Don't focus on Salary for first 3 years.. focus on building your competency\nVII. Always keep learning\n\n * Please use the Internet for more than facebook or whatsapp.\n * Please use Youtube for more than Cat videos and O so cute videos\n * Keep learning .. just for the sake of it\n * Learnability is the single largest determinant of whether the career will be good or will be exemplary\nVIII. Confidence\n\nIf you focus and implement all the above points confidence will flow though each and every cell and will exude from every pore in your body !!!\n\nAlways look ahead !!!", "2": "95% engineers in India unfit for software development jobs\n\nThese is what came out from a study carried out by an assessment company. According to a study by employability assessment company Aspiring Minds, only 4.77 per cent candidates can write the correct logic for a programme — a minimum requirement for any programming job.\n\nTherefore majority of engineering graduates are not able to find a decent job in the IT and Software sector in India. Every year around 8 lakhs engineers graduate and of these only 20% i.e. around 1.6 lakhs actually get a job.\n\nSo what is the main for such a bad condition of engineers employability:\n\n1. Outdated curriculum in colleges: There focus of study is still in outdated technologies such as C and Java.\n2. Lack of Industry approach: The curriculum taught in colleges have not been updated with the requirements as that of IT industry.\n3. Lack of practical approach: Still in our country academics is given more importance than practical knowledge which leaves students unprepared.\nNow comes the question that what does the industry requires so that in can hire these students. Based on recent trends, skills have become more important than the actual degree that you do in order to get a job.\n\nNow in IT and Software sector, some of the job-roles or domain which are trending and expected to thrive in future due to Digital revolution and Internet boom. You may opt to acquire skills in the given domain for a better career path.\n\nWeb Development: Internet widespread use has led to increase in usage of Websites and Web Applications. One would require skills in technologies such as Javascript, JSON, AngularJS, NodeJS, Express JS and MongoDB in order to get job as Web Developer. Job-roles of this domain such as Frontend Developer, Backend Developer and MEAN Stack Developer are in great demand in terms of both growth opportunity as well as salary offered to them. The average salary of MEAN Stack Developer is over 7 LPA depending on the skill set one has.\n\nData Scientist: Data Scientists are responsible for analysis of data with a goal of discovering insights which in turn can provide a competitive advantage or address a pressing business problem. His role is to analyze data from different angles, determine what is means and then recommend ways to apply that data. The skills required to become Data Scientist are Statistics, R Programming, Predictive Modelling, Machine Learning Algorithms & Text Mining. Data Scientist are deemed as “Sexiest Job of 21st century” and their average salary in India is over 6 LPA.\n\nBut foremost its important that you learn and acquire skills in technologies and programming languages required for these roles. So in order to get into a product based company you need to :\n\n * Acquire Skills in Job-role or career path of your choice from expert professionals from Industry.\n * Do Live Project to validate your learning and show your expertise over the domain.\n * You appear for the interview and voila Get Hired as your dream job-role\nThere are so many options available online to start your learning. But if you are looking to start your career in this particular domain then I would say you can go for below mentioned platforms\n\n * Training centres: A lot of training and coaching centres are there which offers courses in these technologies. But there is no reliability of the course content and teachers as they lacks industry experience and current scenario.\n * Edureka, Udemy, Simplilearn: These platforms provides certifications so that one can acquire skills in the mentioned domain. But certificates do not guarantee job and career growth.\n * edWisor.com [ https://www.quora.com/topic/edWisor-com ] is one such platform which not only gets you skilled in the mentioned career path but also get you hired in product based companies. There are over 100+ companies that are hiring edWisor skilled candidates as interns/full-time role.\nAll the best.", "3": "1) If you are interested in web development, learn PHP/.net/ROR/Python along with web technologies like HTML, Javascript, CSS\n\n2) If you want your career in ERP companies, learn JAVA (also works for Android development)\n\n3) For iOS development, you need to learn Objective C\n\n4) Do networking certifications like CCNA to land into networking related jobs\n\n5) Soft skills : You should learn them regardless of the path you choose. It will also help you in getting a non technical job like Business analyst", "4": "Skill becomes when you apply it. Make sure you have a string of projects (size and lines of code does not matter) done in school to talk about with your prospective employer. Web based,  data-base involved, mobile app related projects are relevant.", "5": "I am a 65-year-old software engineer who has worked for Apple, Adobe, eBay, Microsoft, VMware, Cisco, FileMaker, XO Communications, 2Wire, Egnyte, Nexsan, and two other start-ups. I have been laid off five times in my career. I always find another job within 3 to 4 weeks — even during a recession. I have had my job outsourced to India or China four times: especially in the last eight years. Nonetheless, there is always another employment opportunity waiting afterwards.\n\nI love what I do. I’m still doing it; and, I have no immediate plans to stop doing it. Moreover, I am good at it. That’s not so much because I am a genius but rather because I have been doing software development for a really long time and I learned from my mistakes. In fact, there is no wide-spread computer language I can’t program in. Nor is there any OS platform I am not comfortable working on. And, besides the U.S., I have also worked overseas in Apple’s factories in China and Ireland. Besides English, I’ve learned to speak (poorly) Spanish and Italian, and I can manage about a ten phrases in Mandarin.\n\nI have managed to do all this while successfully being married for 40 years, raised two adult children (one who is a Netflix software engineer), and I now have five grandchildren. According to the last Social Security report I receive annually from the government, my total lifetime income to date is: $3,042,040; and, I’m not done yet.\n\nHaving said all this, it is very much true that age discrimination and outsourcing is rampant in the Silicon Valley. Before age 45, I had a better than average chance of getting a job after a single interview. Now, at age 64, it takes me about ten interviews before I get the next job. Even then I sometimes have to work as a contractor without benefits. And, I have even learned to tolerate being interviewed by arrogant and entitled young preppies, most whom think they are somehow better than me even though they haven’t accomplished one tenth of what I have, nor have my superb academic credentials. (I have a B.S. in Civil Engineering and a M.S. in Computer Science from Texas A&M University — the latter at the top of my class.)\n\nSo, the answer to your question is: NO, software development is most certainly not a dead end job! It is a great job. Does it get tougher to get your next job as you get older? Oh hell yes. But, so what! If you love it as I do nothing but death or poor health can stop you. All it takes is a determination.\n\nNever give up!\n\nFollow up edit: Wow! Thanks for all of the great comments and positive feedback! After much thought and consideration, I have decided to move into part-time consulting and full-time retirement on September 1, 2019. However, I will still be programming and possibly teaching at the nearby Texas State University - San Marcos. I’m not giving up. I’m just moving on to a new phase.\n\n—\n\nSteve Ussery", "6": "I attended many interviews: Google, Facebook, Linkedin, many startups. All want me to do white boarding. They want me to write functional working code on the board without a computer and no internet to search.\n\nI was unemployed for many months. Waited hoping one day someone will hire me without requiring me to white-boarding. Yep it is worse than water-boarding.\n\nAfter 7 months I realized - no other choice. Now I can white board in my sleep. Companies are in line to talk to me. They are ready to send flowers and even ready to send drivers to pick me up.\n\nNothing changed - just learned to “white wash”.\n\nTHE END", "7": "I'm 43 (turning 44 in October), and three years ago I moved from Italy, where I had my own start-up,  to London, where I worked as a permanent employee for the 1st year, and for the following two as a contractor, doubling my salary and the opportunities to have fun. \n\nEven though I had a lot of chances to increase my daily rate even more, I was sick and tired of the big city so I've now moved to Malaga, Spain, where after 18 years of career I find myself currently working on the most interesting  projects I've ever worked (I didn't honestly think it'd happen), in a company that pays me almost the same as London's but with one third of the cost of life (enjoying also a far better lifestyle and weather btw). \n\nNote that I'm still coding, not doing any management or leading position (my team lead is two years younger than me). While here I'm already getting offers from the few companies with offices in this small (at least compared to London) city. If you consider also the high unemployment rate of Spain, especially the region of Andalusia, it is remarkable how by doing this job you can basically reinvent yourself everywhere and in every way.\n\nSo, don't worry, software engineering is not a dead end career. ", "8": "For the most part - quick to get employment - but difficult to find long term stable employment\n\nI am not a big fan of most people learning “software engineering” alone - Industries Are quick to hire people with very specific skills but rarely invest in people updating and maintaining those skills - a broader background is much better for most people.\n\nFor people who have a full and complete understanding and skills about all aspects of computers - hardware, operating systems, applications development, device drivers, network connectivity, etc and work to keep up in all these areas - $600,000 per year. I know exactly one person at this level (I have worked in Silicon Valley on and off for over 35 years).\n\nFor someone highly skilled in a single area which is currently in demand - up to $200,000 per year - and no job in 5–10 years\n\nI have seen more out of work software engineers than optical, mechanical, electrical, chemical, or even civil engineers\n\nI have seen many aeronautical engineers switch fields (typically mechanical) due to lack of demand\n\nFor long term job stability: Optical and mechanical (not necessarily highest pay) - possibly Chemical (with some sort of Masters - very good job stability)\n\nBut learn to program - even if you do not write code for the job, the knowledge is very useful.\n\nFor people like me - focused on one area of engineering or the physical sciences with good software skills (I wrote my first program in 1977)- lots of good opportunities (the longest I went without a job was 2 weeks).", "9": "Completely disagree with this statement. I would class a job in a factory as a dead end job. If you work in a factory on a production line for 10 years and leave you will have 0 transferrable skills. However if you leave a programming job of 10 years you will have a wealth of industry experience. You will be able to demand a higher salary as a result of your experience.\n\nYou will never be without a job because the demand for programmers is off the charts. Don’t believe me? Go to any job website and search for programmers jobs:) Because of this you can choose the type of jobs you like. So you don’t have to work in large corporations or banks if you don’t want to. If you don’t fancy the culture of a company you don’t have to accept the job offer.\n\nApart from the demand for programming you can also try contracting. You can easily make 500 to 700 euro a day. How many people do you know make that kind of money?\n\nProgramming gives you freedom…\n\nYou can work as a programmer pretty much anywhere in the world. Programmers are needed everywhere. You can also work remotely. You can get a job as a remote programmer for a company based in a western country like the US and be getting paid 120000 dollars a year while living in a country where the price of a beer in a pub is 50 cent.\n\nPeople who usually like these negative statements about software development are people who either do not like programming or don’t or cant program. Programing is art. It is very creative. It is the perfect mixture of art and logic. I love my job. I spend my day basically getting well paid to do puzzles. Aren’t puzzles recreational? Just today I had three moments where I punched the air in triumph after solving a programming puzzle. Currently I work from home so I also let out a big shout each time. Its like watching your favorite team score a goal. I rarely take my job home with me. Maybe once a year will I have an evening that I bitch about stuff in work. But very rarely.\n\nHow can programming be a dead end job when you can go on to do so many other jobs related to it in I.T. If you don’t want to program anymore. You can go on to be a development manager, an architect, a product manager, CTO, CEO, Entrepreneur.\n\nYou can create your own software and sell it. Start or join a startup and take equity as lead developer/ CTO. How do you think these people became billionaires? Elon Musk, Bill Gates, Larry Page, Sergey Brinn, Mark Zuckerburg? Because they could program!\n\nHow many professions have the same amount of opportunities, job satisfaction and possibilities as software engineers? Not many.\n\nIt is Far from a dead end job."}